yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8af6199.h
/*-------------------------------------------------------------------------
 *      STM8 definitions of SFR registers
 *
 *      Used with STM8 IAR C/C++ Compiler and Assembler.
 *
 *      Copyright 2017 IAR Systems AB.
 *
 *-----------------------------------------------------------------------*/

#ifndef __IOSTM8AF6199_H__
#define __IOSTM8AF6199_H__

#if (((__TID__ >> 8) & 0x7F) != 0x38)     /* 0x38 = 56 dec */
#error This file should only be compiled by STM8 IAR compiler and assembler
#endif

/*-------------------------------------------------------------------------
 *      I/O register macros
 *-----------------------------------------------------------------------*/

#include "io_macros.h"


#ifdef __IAR_SYSTEMS_ICC__
#pragma system_include
#pragma language=save
#pragma language=extended
#endif

/*-------------------------------------------------------------------------
 *      Option byte attribute define
 *-----------------------------------------------------------------------*/
 
#define OPTION_BYTE_ATTRIBUTES __root const volatile __ro_placement
 
/*-------------------------------------------------------------------------
 *      Option bytes register definitions
 *-----------------------------------------------------------------------*/

/*-------------------------------------------------------------------------
 *      Option bytes addresses
 *-----------------------------------------------------------------------*/
#define OPT0_ADDR        0x4800
#define OPT1_ADDR        0x4801
#define NOPT1_ADDR       0x4802
#define OPT2_ADDR        0x4803
#define NOPT2_ADDR       0x4804
#define OPT3_ADDR        0x4805
#define NOPT3_ADDR       0x4806
#define OPT4_ADDR        0x4807
#define NOPT4_ADDR       0x4808
#define OPT5_ADDR        0x4809
#define NOPT5_ADDR       0x480a
#define OPT6_ADDR        0x480b
#define NOPT6_ADDR       0x480c
#define OPT7_ADDR        0x480d
#define NOPT7_ADDR       0x480e
#define OPT8_ADDR        0x4810
#define OPT9_ADDR        0x4811
#define OPT10_ADDR       0x4812
#define OPT11_ADDR       0x4813
#define OPT12_ADDR       0x4814
#define OPT13_ADDR       0x4815
#define OPT14_ADDR       0x4816
#define OPT15_ADDR       0x4817
#define OPT16_ADDR       0x4818
#define OPT17_ADDR       0x487e
#define NOPT17_ADDR      0x487f

#define OPT0_DECL        OPTION_BYTE_ATTRIBUTES unsigned char OPT0        @ OPT0_ADDR
#define OPT1_DECL        OPTION_BYTE_ATTRIBUTES unsigned char OPT1        @ OPT1_ADDR
#define NOPT1_DECL       OPTION_BYTE_ATTRIBUTES unsigned char NOPT1       @ NOPT1_ADDR
#define OPT2_DECL        OPTION_BYTE_ATTRIBUTES unsigned char OPT2        @ OPT2_ADDR
#define NOPT2_DECL       OPTION_BYTE_ATTRIBUTES unsigned char NOPT2       @ NOPT2_ADDR
#define OPT3_DECL        OPTION_BYTE_ATTRIBUTES unsigned char OPT3        @ OPT3_ADDR
#define NOPT3_DECL       OPTION_BYTE_ATTRIBUTES unsigned char NOPT3       @ NOPT3_ADDR
#define OPT4_DECL        OPTION_BYTE_ATTRIBUTES unsigned char OPT4        @ OPT4_ADDR
#define NOPT4_DECL       OPTION_BYTE_ATTRIBUTES unsigned char NOPT4       @ NOPT4_ADDR
#define OPT5_DECL        OPTION_BYTE_ATTRIBUTES unsigned char OPT5        @ OPT5_ADDR
#define NOPT5_DECL       OPTION_BYTE_ATTRIBUTES unsigned char NOPT5       @ NOPT5_ADDR
#define OPT6_DECL        OPTION_BYTE_ATTRIBUTES unsigned char OPT6        @ OPT6_ADDR
#define NOPT6_DECL       OPTION_BYTE_ATTRIBUTES unsigned char NOPT6       @ NOPT6_ADDR
#define OPT7_DECL        OPTION_BYTE_ATTRIBUTES unsigned char OPT7        @ OPT7_ADDR
#define NOPT7_DECL       OPTION_BYTE_ATTRIBUTES unsigned char NOPT7       @ NOPT7_ADDR
#define OPT8_DECL        OPTION_BYTE_ATTRIBUTES unsigned char OPT8        @ OPT8_ADDR
#define OPT9_DECL        OPTION_BYTE_ATTRIBUTES unsigned char OPT9        @ OPT9_ADDR
#define OPT10_DECL       OPTION_BYTE_ATTRIBUTES unsigned char OPT10       @ OPT10_ADDR
#define OPT11_DECL       OPTION_BYTE_ATTRIBUTES unsigned char OPT11       @ OPT11_ADDR
#define OPT12_DECL       OPTION_BYTE_ATTRIBUTES unsigned char OPT12       @ OPT12_ADDR
#define OPT13_DECL       OPTION_BYTE_ATTRIBUTES unsigned char OPT13       @ OPT13_ADDR
#define OPT14_DECL       OPTION_BYTE_ATTRIBUTES unsigned char OPT14       @ OPT14_ADDR
#define OPT15_DECL       OPTION_BYTE_ATTRIBUTES unsigned char OPT15       @ OPT15_ADDR
#define OPT16_DECL       OPTION_BYTE_ATTRIBUTES unsigned char OPT16       @ OPT16_ADDR
#define OPT17_DECL       OPTION_BYTE_ATTRIBUTES unsigned char OPT17       @ OPT17_ADDR
#define NOPT17_DECL      OPTION_BYTE_ATTRIBUTES unsigned char NOPT17      @ NOPT17_ADDR


/*-------------------------------------------------------------------------
 *      Port A register definitions
 *-----------------------------------------------------------------------*/
/* Port A data output latch register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ODR0        : 1;
  unsigned char ODR1        : 1;
  unsigned char ODR2        : 1;
  unsigned char ODR3        : 1;
  unsigned char ODR4        : 1;
  unsigned char ODR5        : 1;
  unsigned char ODR6        : 1;
  unsigned char ODR7        : 1;
} __BITS_PA_ODR;
#endif
__IO_REG8_BIT(PA_ODR,      0x5000, __READ_WRITE, __BITS_PA_ODR);

/* Port A input pin value register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char IDR0        : 1;
  unsigned char IDR1        : 1;
  unsigned char IDR2        : 1;
  unsigned char IDR3        : 1;
  unsigned char IDR4        : 1;
  unsigned char IDR5        : 1;
  unsigned char IDR6        : 1;
  unsigned char IDR7        : 1;
} __BITS_PA_IDR;
#endif
__IO_REG8_BIT(PA_IDR,      0x5001, __READ, __BITS_PA_IDR);

/* Port A data direction register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char DDR0        : 1;
  unsigned char DDR1        : 1;
  unsigned char DDR2        : 1;
  unsigned char DDR3        : 1;
  unsigned char DDR4        : 1;
  unsigned char DDR5        : 1;
  unsigned char DDR6        : 1;
  unsigned char DDR7        : 1;
} __BITS_PA_DDR;
#endif
__IO_REG8_BIT(PA_DDR,      0x5002, __READ_WRITE, __BITS_PA_DDR);

/* Port A control register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char C10         : 1;
  unsigned char C11         : 1;
  unsigned char C12         : 1;
  unsigned char C13         : 1;
  unsigned char C14         : 1;
  unsigned char C15         : 1;
  unsigned char C16         : 1;
  unsigned char C17         : 1;
} __BITS_PA_CR1;
#endif
__IO_REG8_BIT(PA_CR1,      0x5003, __READ_WRITE, __BITS_PA_CR1);

